{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "7f9e9b4b-fcfd-413d-8e10-e556d63e7f20",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'COUNT(n)': 56849}]\n"
     ]
    }
   ],
   "source": [
    "from py2neo import Graph\n",
    "\n",
    "# Connect to Neo4j using bolt://localhost:7687\n",
    "graph = Graph(\"bolt://localhost:7687\", auth=(\"neo4j\", \"password\"))\n",
    "\n",
    "# Test the connection by running a basic query\n",
    "result = graph.run(\"MATCH (n) RETURN COUNT(n)\").data()\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "1dc0fca2-10dd-491f-a858-c0dc0c5bbe39",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Director: Paul W. S. Anderson, Production Company: 20th Century Fox, Actor: ['Ian Whyte', 'Tommy Flanagan']\n",
      "Director: Todd Solondz, Production Company: Killer Films, Actor: ['Cynthia Stevenson', 'Gerry Becker']\n",
      "Director: George Armitage, Production Company: Caravan Pictures, Actor: ['Dan Aykroyd', 'Hank Azaria']\n",
      "Director: Tom Savini, Production Company: Columbia Pictures, Actor: ['Bill Moseley', 'Tony Todd']\n",
      "Director: Jon Amiel, Production Company: Regency Enterprises, Actor: ['Sean Connery', 'Ving Rhames']\n",
      "Director: Rachel Talalay, Production Company: New Line Cinema, Actor: ['Robert Englund', 'Yaphet Kotto']\n",
      "Director: Tom Hanks, Production Company: 20th Century Fox, Actor: ['Charlize Theron', 'Liv Tyler']\n",
      "Director: Martin Campbell, Production Company: Columbia Pictures, Actor: ['Antonio Banderas', 'Julio Oscar Mechoso']\n",
      "Director: Alain Berliner, Production Company: Lakeshore Entertainment, Actor: ['William Fichtner', 'Stellan Skarsgård']\n",
      "Director: Malcolm D. Lee, Production Company: Dimension Films, Actor: ['Affion Crockett', 'Samuel L. Jackson']\n",
      "Director: Joel Coen, Production Company: Paramount Pictures, Actor: ['Domhnall Gleeson', 'Josh Brolin']\n",
      "Director: Colin Trevorrow, Production Company: Universal Pictures, Actor: ['Katie McGrath', 'Chris Pratt']\n",
      "Director: Michael Taverna, Production Company: 1303 Productions, Actor: ['John Diehl', 'Corey Sevier']\n",
      "Director: Julio Soto Gurpide, Production Company: Silver Reel, Actor: ['Bob Bergen', 'Lewis Macleod']\n",
      "Director: David Lean, Production Company: HBO Films, Actor: ['Richard Wilson', 'Alec Guinness']\n",
      "Director: Ron Shelton, Production Company: Warner Bros. Pictures, Actor: ['Richard Lineback', 'Kevin Costner']\n",
      "Director: Jeannot Szwarc, Production Company: TriStar Pictures, Actor: ['John Lithgow', 'John Hallam']\n",
      "Director: Jeff Fowler, Production Company: Paramount Pictures, Actor: ['Idris Elba', 'Ben Schwartz']\n",
      "Director: Louis Leterrier, Production Company: Warner Bros. Pictures, Actor: ['Nicholas Hoult', 'Pete Postlethwaite']\n",
      "Director: Irwin Winkler, Production Company: Columbia Pictures, Actor: ['Sandra Bullock', 'Jeremy Northam']\n",
      "Director: Fred Savage, Production Company: Revolution Studios, Actor: ['Richard Gant', 'Cuba Gooding Jr.']\n",
      "Director: Brett Ratner, Production Company: Paramount Pictures, Actor: ['Ian Whyte', 'Rebecca Ferguson']\n",
      "Director: Joe Wright, Production Company: Warner Bros. Pictures, Actor: ['Jimmy Vee', 'Jack Lowden']\n",
      "Director: Mark Mylod, Production Company: Capitol Films, Actor: ['Giovanni Ribisi', 'Tim Blake Nelson']\n",
      "Director: Peter Yates, Production Company: 20th Century Fox, Actor: ['Robert Redford', 'Christopher Guest']\n",
      "Director: John Landis, Production Company: Warner Bros. Pictures, Actor: ['Dan Aykroyd', 'Frank Oz']\n",
      "Director: Reed Morano, Production Company: Paramount Pictures, Actor: ['Jude Law', 'Richard Brake']\n",
      "Director: Ramón Menéndez, Production Company: Hollywood Pictures, Actor: ['Lenny Venito', 'Benicio del Toro']\n",
      "Director: Dave Green, Production Company: Paramount Pictures, Actor: ['Megan Fox', 'Alan Ritchson']\n",
      "Director: Pierre Perifel, Production Company: DreamWorks Animation, Actor: ['Anthony Ramos', 'Awkwafina']\n",
      "Director: Robert Townsend, Production Company: New Line Cinema, Actor: ['Faizon Love', 'Martin Landau']\n",
      "Director: Francis Lawrence, Production Company: 20th Century Fox, Actor: ['Jeremy Irons', 'Charlotte Rampling']\n",
      "Director: Jon Avnet, Production Company: Universal Pictures, Actor: ['Gailard Sartain', 'Kathy Bates']\n",
      "Director: Steve Carver, Production Company: Santa Fe Productions, Actor: ['Peter Maloney', 'Sylvester Stallone']\n",
      "Director: Guillermo del Toro, Production Company: TSG Entertainment, Actor: ['Michael Stuhlbarg', 'Sally Hawkins']\n",
      "Director: Bill Couturié, Production Company: Universal Pictures, Actor: ['Jack Warden', 'Zack Ward']\n",
      "Director: J. Mackye Gruber, Production Company: New Line Cinema, Actor: ['Amy Smart', 'Kevin Durand']\n",
      "Director: Ken Finkleman, Production Company: Paramount Pictures, Actor: ['Kent McCord', 'Rip Torn']\n",
      "Director: Walt Becker, Production Company: Touchstone Pictures, Actor: ['Kevin Durand', 'Martin Lawrence']\n",
      "Director: Craig Gillespie, Production Company: LuckyChap Entertainment, Actor: ['Bojana Novaković', 'Allison Janney']\n",
      "Director: Richard Linklater, Production Company: Detour Filmproduction, Actor: ['Steven Chester Prince', 'Ethan Hawke']\n",
      "Director: Gary Winick, Production Company: Summit Entertainment, Actor: ['Marcia DeBonis', 'Gael García Bernal']\n",
      "Director: Kirk Jones, Production Company: Universal Pictures, Actor: ['Emma Thompson', 'Derek Jacobi']\n",
      "Director: Jocelyn Moorhouse, Production Company: Universal Pictures, Actor: ['Kate Winslet', 'Hugo Weaving']\n",
      "Director: Clint Eastwood, Production Company: Warner Bros. Pictures, Actor: ['Diane Venora', 'Bernard Hill']\n",
      "Director: John Lee Hancock, Production Company: FilmNation Entertainment, Actor: ['Michael Keaton', 'Laura Dern']\n",
      "Director: Roland Emmerich, Production Company: Lionsgate, Actor: ['Jake Gyllenhaal', 'Ian Holm']\n",
      "Director: Anthony Russo, Production Company: Universal Pictures, Actor: ['Bill Hader', 'Seth Rogen']\n",
      "Director: Tom McGrath, Production Company: DreamWorks Animation, Actor: ['Willow Smith', 'Alec Baldwin']\n",
      "Director: Nick Cassavetes, Production Company: New Line Cinema, Actor: ['Abigail Breslin', 'Alec Baldwin']\n",
      "Director: Jack Smight, Production Company: 20th Century Fox, Actor: ['George Peppard', 'Paul Winfield']\n",
      "Director: Chris Miller, Production Company: DreamWorks Animation, Actor: ['Ian McShane', 'Seth Rogen']\n",
      "Director: Bobs Gannaway, Production Company: Walt Disney Pictures, Actor: ['Wes Studi', 'Ed Harris']\n",
      "Director: Lawrence Kasdan, Production Company: Village Roadshow Pictures, Actor: ['Tom Sizemore', 'Morgan Freeman']\n",
      "Director: Ron Howard, Production Company: Universal Pictures, Actor: ['Jennifer Connelly', 'Talulah Riley']\n",
      "Director: Kevin Reynolds, Production Company: Universal Pictures, Actor: ['Gerard Murphy', 'Jack Black']\n",
      "Director: Burr Steers, Production Company: Screen Gems, Actor: ['Hermione Corfield', 'Lena Headey']\n",
      "Director: Bobby Farrelly, Production Company: Metro-Goldwyn-Mayer, Actor: ['Woody Harrelson', 'Randy Quaid']\n",
      "Director: Sam Raimi, Production Company: Columbia Pictures, Actor: ['J.K. Simmons', 'Willem Dafoe']\n",
      "Director: Cal Brunker, Production Company: Paramount Pictures, Actor: ['Lil Rel Howery', 'Chris Rock']\n",
      "Director: Ang Lee, Production Company: Focus Features, Actor: ['Anne Hathaway', 'Heath Ledger']\n",
      "Director: Tim Story, Production Company: Marvel Studios, Actor: ['Ioan Gruffudd', 'Laurence Fishburne']\n",
      "Director: Edgar Wright, Production Company: dentsu, Actor: ['Brie Larson', 'Mae Whitman']\n",
      "Director: Don Mancini, Production Company: Universal 1440 Entertainment, Actor: ['Jennifer Tilly', 'Brad Dourif']\n",
      "Director: Ron Howard, Production Company: Universal Pictures, Actor: ['Clint Howard', 'Jeffrey Tambor']\n",
      "Director: John Carney, Production Company: Apatow Productions, Actor: ['Hailee Steinfeld', 'Mark Ruffalo']\n",
      "Director: John Carpenter, Production Company: Universal Pictures, Actor: ['Keith David', 'Kurt Russell']\n",
      "Director: Tony Goldwyn, Production Company: DreamWorks Pictures, Actor: ['Blythe Danner', 'Tom Wilkinson']\n",
      "Director: Chris Columbus, Production Company: Ingenious Media, Actor: ['Lauren Storm', 'Hayden Panettiere']\n",
      "Director: Andrea Arnold, Production Company: Film4 Productions, Actor: ['Shia LaBeouf', 'Riley Keough']\n",
      "Director: Chris Nahon, Production Company: Focus Features, Actor: ['Andrew Pleavin', 'Khary Payton']\n",
      "Director: Jon Turteltaub, Production Company: Jerry Bruckheimer Films, Actor: ['Adriane Lenox', 'Toby Kebbell']\n",
      "Director: Mark Waters, Production Company: DreamWorks Pictures, Actor: ['Reese Witherspoon', 'Mark Ruffalo']\n",
      "Director: Tony Scott, Production Company: Warner Bros. Pictures, Actor: ['Frank Collison', 'Noble Willingham']\n",
      "Director: Lee Toland Krieger, Production Company: Lionsgate, Actor: ['Ellen Burstyn', 'Harrison Ford']\n",
      "Director: Russell Mulcahy, Production Company: Warner Bros. Pictures, Actor: ['Arkie Whiteley', 'John Howard']\n",
      "Director: Jared Hess, Production Company: Relativity Media, Actor: ['Jill Jane Clements', 'Kristen Wiig']\n",
      "Director: Anand Tucker, Production Company: Universal Pictures, Actor: ['Amy Adams', 'Ian McElhinney']\n",
      "Director: Joe Dante, Production Company: AVCO Embassy Pictures, Actor: ['Kevin McCarthy', 'Noble Willingham']\n",
      "Director: John Patrick Shanley, Production Company: Warner Bros. Pictures, Actor: ['Robert Stack', 'Meg Ryan']\n",
      "Director: Rob Reiner, Production Company: Spinal Tap Prod., Actor: ['Fred Willard', 'Michael McKean']\n",
      "Director: Stephen Norrington, Production Company: New Line Cinema, Actor: ['Traci Lords', 'Wesley Snipes']\n",
      "Director: Mimi Leder, Production Company: Paramount Pictures, Actor: ['Elijah Wood', 'Morgan Freeman']\n",
      "Director: Sophia Takal, Production Company: Universal Pictures, Actor: ['Imogen Poots', 'Cary Elwes']\n",
      "Director: Kevin Smith, Production Company: Phase 4 Films, Actor: ['Genesis Rodriguez', 'Haley Joel Osment']\n",
      "Director: Robert Altman, Production Company: Paramount Pictures, Actor: ['Paul Dooley', 'Donald Moffat']\n",
      "Director: Gore Verbinski, Production Company: DreamWorks Pictures, Actor: ['Mayra Sérbulo', 'Castulo Guerra']\n",
      "Director: Duncan Jones, Production Company: Summit Entertainment, Actor: ['Jake Gyllenhaal', 'Jeffrey Wright']\n",
      "Director: Blake Edwards, Production Company: Metro-Goldwyn-Mayer, Actor: ['Steve Franken', 'Robert Loggia']\n",
      "Director: Janusz Kamiński, Production Company: New Line Cinema, Actor: ['Alfre Woodard', 'John Hurt']\n",
      "Director: Mark A.Z. Dippé, Production Company: New Line Cinema, Actor: ['Frank Welker', 'John Leguizamo']\n",
      "Director: Olivia Wilde, Production Company: Annapurna Pictures, Actor: ['Will Forte', 'Billie Lourd']\n",
      "Director: Dan O'Bannon, Production Company: Orion Pictures, Actor: ['John Philbin', 'James Karen']\n",
      "Director: Tommy O'Haver, Production Company: World 2000 Entertainment, Actor: ['Hugh Dancy', 'Cary Elwes']\n",
      "Director: Ash Brannon, Production Company: Columbia Pictures, Actor: ['Bob Bergen', 'Shia LaBeouf']\n",
      "Director: Steven Spielberg, Production Company: Universal Pictures, Actor: ['Samuel L. Jackson', 'Jeff Goldblum']\n",
      "Director: Todd Komarnicki, Production Company: Angel Studios, Actor: ['Clarke Peters', 'Flula Borg']\n",
      "Director: Aaron Norris, Production Company: Golan-Globus Productions, Actor: ['Chuck Norris', 'Keith David']\n",
      "Director: Lorene Scafaria, Production Company: Focus Features, Actor: ['Connie Britton', 'Derek Luke']\n",
      "Director: James Foley, Production Company: Universal Pictures, Actor: ['Josef Sommer', 'Gene Hackman']\n",
      "Director: Isabel Coixet, Production Company: Lakeshore Entertainment, Actor: ['Ben Kingsley', 'Peter Sarsgaard']\n",
      "Director: Jeff Burr, Production Company: Conquest Productions, Actor: ['Harry Caesar', 'Angelo Rossitto']\n",
      "Director: Jun Falkenstein, Production Company: Walt Disney Pictures, Actor: ['Jim Cummings', 'Peter Cullen']\n",
      "Director: John Frankenheimer, Production Company: J&M Entertainment, Actor: ['Andrew McCarthy', 'Sharon Stone']\n",
      "Director: Ben Affleck, Production Company: Mandalay Pictures, Actor: ['Matt Damon', \"Michael O'Neill\"]\n",
      "Director: Warren Beatty, Production Company: Paramount Pictures, Actor: ['Jack Warden', 'R.G. Armstrong']\n",
      "Director: Woody Allen, Production Company: Jack Rollins & Charles H. Joffe Productions, Actor: ['George J. Manos', 'Martin Landau']\n",
      "Director: Neil Jordan, Production Company: The Cannon Group, Actor: ['David Warner', 'Brian Glover']\n",
      "Director: Kevin Greutert, Production Company: Lionsgate, Actor: ['Costas Mandylor', 'Shawnee Smith']\n",
      "Director: Clare Kilner, Production Company: Universal Pictures, Actor: ['Dermot Mulroney', 'Amy Adams']\n",
      "Director: J. Lee Thompson, Production Company: 20th Century Fox, Actor: ['Severn Darden', 'Buck Kartalian']\n",
      "Director: Jaume Collet-Serra, Production Company: StudioCanal, Actor: ['Colin McFarlane', 'Florence Pugh']\n",
      "Director: John McTiernan, Production Company: Metro-Goldwyn-Mayer, Actor: ['Eugene Lipinski', 'Rebecca Romijn']\n",
      "Director: Robert Longo, Production Company: TriStar Pictures, Actor: ['Henry Rollins', 'Keanu Reeves']\n",
      "Director: Rick Famuyiwa, Production Company: 20th Century Fox, Actor: ['Nicole Ari Parker', 'Sterling K. Brown']\n",
      "Director: Joe Wright, Production Company: Universal Pictures, Actor: ['Benedict Cumberbatch', 'Harriet Walter']\n",
      "Director: Jay Roach, Production Company: Lionsgate, Actor: ['Rob Delaney', 'Nicole Kidman']\n",
      "Director: Adam McKay, Production Company: Hyperobject Industries, Actor: ['Leonardo DiCaprio', 'Timothée Chalamet']\n",
      "Director: Hans Petter Moland, Production Company: Summit Entertainment, Actor: ['Raoul Max Trujillo', 'Liam Neeson']\n",
      "Director: Jack Smight, Production Company: Universal Pictures, Actor: ['John Fujioka', 'Cliff Robertson']\n",
      "Director: Ang Lee, Production Company: Dune Entertainment, Actor: ['Suraj Sharma', 'Rafe Spall']\n",
      "Director: J.B. Rogers, Production Company: 20th Century Fox, Actor: ['John Rothman', 'Julie White']\n",
      "Director: Gregory Hoblit, Production Company: Paramount Pictures, Actor: ['Frances McDormand', 'Edward Norton']\n",
      "Director: Andrew Stanton, Production Company: Walt Disney Pictures, Actor: ['Paul Eiding', 'Sigourney Weaver']\n",
      "Director: David Lynch, Production Company: CiBy 2000, Actor: ['Bill Pullman', 'Henry Rollins']\n",
      "Director: Alan J. Pakula, Production Company: Hollywood Pictures, Actor: ['E.G. Marshall', 'Forest Whitaker']\n",
      "Director: Greg Mottola, Production Company: Miramax, Actor: ['Marcia Gay Harden', 'Jon Hamm']\n",
      "Director: Eran Creevy, Production Company: Silver Pictures, Actor: ['Felicity Jones', 'Nicholas Hoult']\n",
      "Director: Tate Taylor, Production Company: DreamWorks Pictures, Actor: ['Edgar Ramírez', 'Rebecca Ferguson']\n",
      "Director: Guy Ritchie, Production Company: STXfilms, Actor: ['Josh Hartnett', 'Cary Elwes']\n",
      "Director: Robert Zemeckis, Production Company: Paramount Pictures, Actor: ['Peter Gerety', 'Denzel Washington']\n",
      "Director: Tarsem Singh, Production Company: New Line Cinema, Actor: ['Jack Conley', 'Peter Sarsgaard']\n",
      "Director: Adam McKay, Production Company: DreamWorks Pictures, Actor: ['Fred Armisen', 'Seth Rogen']\n",
      "Director: Andrea Di Stefano, Production Company: Thunder Road, Actor: ['Rosamund Pike', 'Ana de Armas']\n",
      "Director: David O. Russell, Production Company: Regency Enterprises, Actor: ['Christian Bale', 'Anya Taylor-Joy']\n",
      "Director: John Flynn, Production Company: Warner Bros. Pictures, Actor: ['John Toles-Bey', 'Gina Gershon']\n",
      "Director: Paul Aaron, Production Company: American Cinema Productions, Actor: ['Chuck Norris', 'Charles Cyphers']\n",
      "Director: J. Lee Thompson, Production Company: 20th Century Fox, Actor: ['Colleen Camp', 'John Huston']\n",
      "Director: Bryan Forbes, Production Company: Fadsin Cinema Associates, Actor: ['Michael Higgins', 'Josef Sommer']\n",
      "Director: Paul Weiland, Production Company: Columbia Pictures, Actor: ['Keith Joe Dick', 'Gloria Foster']\n",
      "Director: Joel Zwick, Production Company: Gold Circle Films, Actor: ['Lainie Kazan', 'Bruce Gray']\n",
      "Director: Barry Levinson, Production Company: Metro-Goldwyn-Mayer, Actor: ['Billy Bob Thornton', 'Cate Blanchett']\n",
      "Director: Alan Parker, Production Company: Orion Pictures, Actor: ['Brad Dourif', 'Willem Dafoe']\n",
      "Director: Wolfgang Petersen, Production Company: 20th Century Fox, Actor: ['Brion James', 'Dennis Quaid']\n",
      "Director: Steven R. Monroe, Production Company: Anchor Bay Films, Actor: ['Chad Lindberg', 'Tracey Walter']\n",
      "Director: Josh Gordon, Production Company: Columbia Pictures, Actor: ['Scoot McNairy', 'Javier Bardem']\n",
      "Director: Barry Sonnenfeld, Production Company: Columbia Pictures, Actor: ['Will Smith', 'Harsh Nayyar']\n",
      "Director: James Watkins, Production Company: Blumhouse Productions, Actor: ['Scoot McNairy', 'Mackenzie Davis']\n",
      "Director: Stanley Donen, Production Company: ITC Entertainment, Actor: ['Farrah Fawcett', 'Harvey Keitel']\n",
      "Director: Stephen Herek, Production Company: Walt Disney Pictures, Actor: ['Michael Wincott', 'Philip Tan']\n",
      "Director: Mary Lambert, Production Company: Paramount Pictures, Actor: ['Mary Louise Wilson', 'Denise Crosby']\n",
      "Director: Norman Jewison, Production Company: United Artists, Actor: ['Rod Steiger', 'Sylvester Stallone']\n",
      "Director: Allen Coulter, Production Company: Summit Entertainment, Actor: ['Pierce Brosnan', 'Robert Pattinson']\n",
      "Director: Allen Hughes, Production Company: New Regency Pictures, Actor: ['Jeffrey Wright', 'Russell Crowe']\n",
      "Director: Siân Heder, Production Company: Vendôme Pictures, Actor: ['Lonnie Farmer', 'Eugenio Derbez']\n",
      "Director: Mike Thurmeier, Production Company: 20th Century Fox, Actor: ['John Leguizamo', 'Alan Tudyk']\n",
      "Director: Glenn Ficarra, Production Company: EuropaCorp, Actor: ['Rodrigo Santoro', 'Ewan McGregor']\n",
      "Director: John Patton Ford, Production Company: Low Spark Films, Actor: ['Aubrey Plaza', 'Gina Gershon']\n",
      "Director: Ted Kotcheff, Production Company: Paramount Pictures, Actor: ['Gene Hackman', 'Robert Stack']\n",
      "Director: Jean-Jacques Annaud, Production Company: Allied Filmmakers, Actor: ['Freddie Highmore', 'Teerawat Mulvilai']\n",
      "Director: Allen Hughes, Production Company: New Line Cinema, Actor: ['Brandon Hammond', 'Samuel L. Jackson']\n",
      "Director: Clive Barker, Production Company: New World Pictures, Actor: ['Clare Higgins', 'Niall Buggy']\n",
      "Director: Donald Petrie, Production Company: Warner Bros. Pictures, Actor: ['Rory Culkin', 'Frank Welker']\n",
      "Director: Peter Segal, Production Company: Universal Pictures, Actor: ['Earl Boen', 'Melinda McGraw']\n",
      "Director: Dwight H. Little, Production Company: 20th Century Fox, Actor: ['Earl Boen', 'Danny Trejo']\n",
      "Director: Joseph Kahn, Production Company: Warner Bros. Pictures, Actor: ['Faizon Love', 'Matt Schulze']\n",
      "Director: Richard Fleischer, Production Company: Metro-Goldwyn-Mayer, Actor: ['Arnold Schwarzenegger', 'Sven-Ole Thorsen']\n",
      "Director: Alex Kendrick, Production Company: Kendrick Brothers, Actor: ['Priscilla C. Shirer', 'Alex Kendrick']\n",
      "Director: Kurt Wimmer, Production Company: Dimension Films, Actor: ['Christian Bale', 'David Hemmings']\n",
      "Director: Ari Sandel, Production Company: Wonderland Sound and Vision, Actor: ['Allison Janney', 'Mae Whitman']\n",
      "Director: Andrew Niccol, Production Company: New Line Cinema, Actor: ['Rachel Roberts', 'Al Pacino']\n",
      "Director: Jeff Tremaine, Production Company: Paramount Pictures, Actor: ['Catherine Keener', 'Spike Jonze']\n",
      "Director: Lamont Johnson, Production Company: Columbia Pictures, Actor: ['Ernie Hudson', 'Michael Ironside']\n",
      "Director: Terry Zwigoff, Production Company: Icon Entertainment International, Actor: ['Steve Buscemi', 'Scarlett Johansson']\n",
      "Director: Spike Jonze, Production Company: Annapurna Pictures, Actor: ['Chris Pratt', 'Joaquin Phoenix']\n",
      "Director: Lawrence Kasdan, Production Company: Warner Bros. Pictures, Actor: ['Richard Crenna', 'William Hurt']\n",
      "Director: Stephen Herek, Production Company: Orion Pictures, Actor: ['Clifford David', 'Keanu Reeves']\n",
      "Director: Patrick Read Johnson, Production Company: Touchstone Pictures, Actor: ['Debbie Lee Carrington', 'Gregg Berger']\n",
      "Director: Marc Forster, Production Company: Columbia Pictures, Actor: ['Daniel Craig', 'Jeffrey Wright']\n",
      "Director: Mark Pellington, Production Company: Screen Gems, Actor: ['Lucinda Jenney', 'Will Patton']\n",
      "Director: Joel Schumacher, Production Company: Fox 2000 Pictures, Actor: ['Katie Holmes', 'Colin Farrell']\n",
      "Director: John Dahl, Production Company: ITC Entertainment, Actor: ['Dean Norris', 'Bill Pullman']\n",
      "Director: Danny Boyle, Production Company: Film4 Productions, Actor: ['Ewan McGregor', 'Tony Curran']\n",
      "Director: Todd Phillips, Production Company: Warner Bros. Pictures, Actor: ['Andrew Howard', 'Jeffrey Tambor']\n",
      "Director: Jon M. Chu, Production Company: Warner Bros. Pictures, Actor: ['Awkwafina', 'Gemma Chan']\n",
      "Director: Phil Joanou, Production Company: Columbia Pictures, Actor: ['Dwayne Johnson', 'Kevin Dunn']\n",
      "Director: McG, Production Company: Columbia Pictures, Actor: ['Drew Barrymore', 'Mark Ryan']\n",
      "Director: Cary Solomon, Production Company: Sierra/Affinity, Actor: ['Nellie Sciutto', 'Emma Elle Roberts']\n",
      "Director: Werner Herzog, Production Company: Metro-Goldwyn-Mayer, Actor: ['Robert Pattinson', 'Nicole Kidman']\n",
      "Director: Stephen Merchant, Production Company: 20th Century Fox, Actor: ['Lena Headey', 'Florence Pugh']\n",
      "Director: Steve Carr, Production Company: Davis Entertainment, Actor: ['Patrick Warburton', 'Martin Lawrence']\n",
      "Director: Simon West, Production Company: Becker International, Actor: ['Clark Gregg', 'Tommy Flanagan']\n",
      "Director: Anton Corbijn, Production Company: Walt Disney Pictures, Actor: ['Joe Anderson', 'Toby Kebbell']\n",
      "Director: John Pasquin, Production Company: Indian Paintbrush, Actor: ['David Ogden Stiers', 'Martin Short']\n",
      "Director: Wes Anderson, Production Company: Film4 Productions, Actor: ['Frances McDormand', 'Edward Norton']\n",
      "Director: Damien O'Donnell, Production Company: Columbia Pictures, Actor: ['Lesley Nicol', 'Albert Moses']\n",
      "Director: Takashi Shimizu, Production Company: Columbia Pictures, Actor: ['Teresa Palmer', 'Jennifer Beals']\n",
      "Director: Wolfgang Petersen, Production Company: Interscope Communications, Actor: ['John Mahoney', 'John Malkovich']\n",
      "Director: David Twohy, Production Company: Warner Bros. Pictures, Actor: ['Keith David', 'Vin Diesel']\n",
      "Director: Buddy Van Horn, Production Company: Warner Bros. Pictures, Actor: ['Michael Currie', 'Liam Neeson']\n",
      "Director: Roar Uthaug, Production Company: United Artists, Actor: ['Dominic West', 'Derek Jacobi']\n",
      "Director: Robert Altman, Production Company: Fox Searchlight Pictures, Actor: ['Rutanya Alda', 'Jerry Jones']\n",
      "Director: Mira Nair, Production Company: Working Title Films, Actor: ['Cherry Jones', 'Ewan McGregor']\n",
      "Director: Tim Robbins, Production Company: 20th Century Fox, Actor: ['Clancy Brown', 'Peter Sarsgaard']\n",
      "Director: Rawson Marshall Thurber, Production Company: Marvel Studios, Actor: ['Joel David Moore', 'Hank Azaria']\n",
      "Director: Shane Black, Production Company: Paramount Pictures, Actor: ['Gwyneth Paltrow', 'Robert Downey Jr.']\n",
      "Director: Phil Alden Robinson, Production Company: Stage 6 Films, Actor: ['Ben Affleck', 'Morgan Freeman']\n",
      "Director: Brett Haley, Production Company: Warner Bros. Pictures, Actor: ['Blythe Danner', 'Toni Collette']\n",
      "Director: Michael Caton-Jones, Production Company: Warner Bros. Pictures, Actor: ['David Ogden Stiers', 'Woody Harrelson']\n",
      "Director: Lana Wachowski, Production Company: TSG Entertainment, Actor: ['Carrie-Anne Moss', 'Keanu Reeves']\n",
      "Director: Tom George, Production Company: Warner Bros. Pictures, Actor: ['Reece Shearsmith', 'Tim Key']\n",
      "Director: Howard Deutch, Production Company: New Line Cinema, Actor: ['Brett Cullen', 'Keanu Reeves']\n",
      "Director: Gary Ross, Production Company: Warner Bros. Pictures, Actor: ['Paul Walker', 'Giuseppe Andrews']\n",
      "Director: Barbet Schroeder, Production Company: Universal Pictures, Actor: ['Sandra Bullock', 'Ryan Gosling']\n",
      "Director: John Woo, Production Company: Icon Entertainment International, Actor: ['Wilford Brimley', 'Sven-Ole Thorsen']\n",
      "Director: Mel Gibson, Production Company: Bluegrass Films, Actor: ['Brendan Gleeson', 'Tommy Flanagan']\n",
      "Director: Seth MacFarlane, Production Company: Paramount Pictures, Actor: ['Wes Studi', 'Charlize Theron']\n",
      "Director: Andy Fickman, Production Company: Hat Tip Films, Actor: ['Dennis Haysbert', 'Keegan-Michael Key']\n",
      "Director: Nick Searcy, Production Company: Columbia Pictures, Actor: ['Earl Billings', 'Nick Searcy']\n",
      "Director: Barry Sonnenfeld, Production Company: Warner Bros. Pictures, Actor: ['Will Smith', 'Josh Brolin']\n",
      "Director: Garry Marshall, Production Company: Davis Films, Actor: ['Robert De Niro', 'Cary Elwes']\n",
      "Director: Johannes Roberts, Production Company: 20th Century Fox, Actor: ['Neal McDonough', 'Tom Hopper']\n",
      "Director: Matthew Vaughn, Production Company: Touchstone Pictures, Actor: ['Nicholas Hoult', 'Zoë Kravitz']\n",
      "Director: Kelly Asbury, Production Company: Paramount Pictures, Actor: ['Michael Caine', 'Matt Lucas']\n",
      "Director: Jeff Tremaine, Production Company: Relativity Media, Actor: ['Johnny Knoxville', 'Spike Jonze']\n",
      "Director: Gina Prince-Bythewood, Production Company: Warner Bros. Pictures, Actor: ['Danny Glover', 'Aisha Hinds']\n",
      "Director: Clint Eastwood, Production Company: di Bonaventura Pictures, Actor: ['Xander Berkeley', 'Tom Skerritt']\n",
      "Director: Steven Soderbergh, Production Company: 20th Century Fox, Actor: ['Marin Ireland', 'Jude Law']\n"
     ]
    }
   ],
   "source": [
    "import pandas as pd\n",
    "\n",
    "df_results = pd.read_csv(\"../data/cache/test_movies_query.csv\")\n",
    "# Extract tconst values from the df_results DataFrame (assuming the column name is 'tconst')\n",
    "tconst_values = df_results[\"tconst\"].tolist()\n",
    "\n",
    "directors = []\n",
    "actors = []\n",
    "production_cos = []\n",
    "\n",
    "# Iterate over each tconst and run the query\n",
    "for tconst in tconst_values:\n",
    "    # Prepare the dynamic list of tconsts for the query\n",
    "    tconst_query_list = [tconst]\n",
    "\n",
    "    # Construct the Cypher query for production companies\n",
    "    cypher_query = f\"\"\"\n",
    "    MATCH (m:Movie)-[:PRODUCED_BY]->(pc:ProductionCompany)\n",
    "    WHERE m.tconst IN {tconst_query_list}\n",
    "    WITH pc.name AS studio, count(*) AS count\n",
    "    ORDER BY count DESC\n",
    "    LIMIT 1\n",
    "    RETURN studio\n",
    "    \"\"\"\n",
    "\n",
    "    # Execute the query and process the result\n",
    "    result = graph.run(cypher_query)\n",
    "\n",
    "    # Extract and append the cleaned production company name\n",
    "    for record in result:\n",
    "        production_cos.append(record['studio'].strip())  # Strip spaces and append the cleaned production company name\n",
    "\n",
    "    # Construct the Cypher query for directors\n",
    "    cypher_query2 = f\"\"\"\n",
    "    MATCH (d:Director)-[:DIRECTED]->(m:Movie)\n",
    "    WHERE m.tconst IN {tconst_query_list}\n",
    "    WITH d.name AS director, count(*) AS count\n",
    "    ORDER BY count DESC\n",
    "    LIMIT 1\n",
    "    RETURN director\n",
    "    \"\"\"\n",
    "\n",
    "    # Execute the query and process the result\n",
    "    result = graph.run(cypher_query2)\n",
    "\n",
    "    # Extract and append the cleaned director name\n",
    "    for record in result:\n",
    "        directors.append(record['director'].strip()) \n",
    "\n",
    "    # Construct the Cypher query for top 2 actors\n",
    "    cypher_query3 = f\"\"\"\n",
    "    MATCH (a:Actor)-[:ACTED_IN]->(m:Movie)\n",
    "    WHERE m.tconst IN {tconst_query_list}\n",
    "    WITH a.name AS actor, count(*) AS appearances\n",
    "    ORDER BY appearances DESC\n",
    "    LIMIT 2\n",
    "    RETURN actor\n",
    "    \"\"\"\n",
    "\n",
    "    # Execute the query and process the result\n",
    "    result = graph.run(cypher_query3)\n",
    "    # Append the actors for this movie to the local list (clearing it at each iteration)\n",
    "    actors_for_current_movie = []\n",
    "    for record in result:\n",
    "        actors_for_current_movie.append(record['actor'].strip())\n",
    "\n",
    "    # Append actors list of the current movie to the main actors list\n",
    "    actors.append(actors_for_current_movie)\n",
    "\n",
    "# Print the results for directors, production companies, and actors\n",
    "for record in zip(directors, production_cos, actors):\n",
    "    print(f\"Director: {record[0]}, Production Company: {record[1]}, Actor: {record[2]}\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6ec2e146-03a0-4108-87de-59aba60600da",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
